In [1]:
# Importing Libraries
import sqlite3
import pandas as pd

In [2]:
# Connecting with SQLite database
sqlite_con = sqlite3.connect("db_sqlite.db")

In [3]:
# Create table
create_table_query = """
CREATE TABLE IF NOT EXISTS table_1 (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER
);
"""

sqlite_con.execute(create_table_query)

In [9]:
# Drop table - if exists
drop_table_query = """
DROP TABLE IF EXISTS tabela;
"""
sqlite_con.execute(drop_table_query)

In [5]:
# Insert data in the table
data = [
    (1, "João", 25),
    (2, "Maria", 30),
    (3, "José", 28),
    (4, None, None)
]

insert_query = """INSERT INTO table_1 (id, name, age) VALUES (?, ?, ?)"""
sqlite_con.executemany(insert_query, data)

In [6]:
# Saving Alterations
sqlite_con.commit()

In [7]:
# Consulting with pandas
select_query = """
SELECT * 
FROM table_1"""

df = pd.read_sql(select_query, sqlite_con)

# Show Dataframe
df

   id   name   age
0   1   João  25.0
1   2  Maria  30.0
2   3   José  28.0
3   4   None   NaN

In [8]:
# Setting Parameters
name_filter = "M%"
age_filter = "25"

# Consulting with Parameters
query = """
SELECT * 
FROM table_1 
WHERE name LIKE ? AND age > ?"""

# Saving query result as a Dataframe
df = pd.read_sql(query, sqlite_con, params=(name_filter, age_filter))

# Show dataframe
df

   id   name  age
0   2  Maria   30

In [10]:
# Creating a Dataframe
df = pd.DataFrame({"band": ["Linking Park", "Foo Fighters", "Sabbaton"], "style": ["Nu Rock", "Rock", "Metal"]})
df

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal

In [11]:
# Converting to .csv
'df.to_csv("bands.csv")' # Just to show

df.to_sql("band", sqlite_con, if_exists="replace", index=False)

3

In [12]:
# Consulting from the database
query = """
SELECT * 
FROM band"""

# Dataframe from query
df = pd.read_sql(query, sqlite_con)

df

           band    style
0  Linking Park  Nu Rock
1  Foo Fighters     Rock
2      Sabbaton    Metal

In [11]:
# Close connection with Database
sqlite_con.close()